Catalogs/РС_ФизическиеЛица.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>РС_ФизическиеЛица</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФИО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НетКИ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РС_ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РС_Страны</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РС_Регионы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РС_Города</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/РС_ФизическиеЛица/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаСервере
Процедура КомандаЗаполнитьСправочникНаСервере()   
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ФизическиеЛица.Ссылка КАК Ссылка,
	|	ФизическиеЛица.Наименование КАК Наименование,
	|	ФизическиеЛица.ДатаРождения КАК ДатаРождения,
	|	ФизическиеЛица.ИНН КАК ИНН,
	|	ФизическиеЛица.ФИО КАК ФИО,
	|	ФизическиеЛица.Фамилия КАК Фамилия,
	|	ФизическиеЛица.Имя КАК Имя,
	|	ФизическиеЛица.Отчество КАК Отчество
	|ИЗ
	|	Справочник.ФизическиеЛица КАК ФизическиеЛица
	|ГДЕ
	|	ФизическиеЛица.ЭтоГруппа = ЛОЖЬ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Табл = РезультатЗапроса.Выгрузить();
	
	Источник = РС_ОбщийМодульСервер.СоздатьИсточникЭтаБаза();
	 
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Структура = Новый Структура;
		Структура.Вставить("Наименование"	, ВыборкаДетальныеЗаписи.Наименование);
		Структура.Вставить("Фамилия"		, ВыборкаДетальныеЗаписи.Фамилия);
		Структура.Вставить("Имя"			, ВыборкаДетальныеЗаписи.Имя);
		Структура.Вставить("Отчество"		, ВыборкаДетальныеЗаписи.Отчество);
		Структура.Вставить("ДатаРождения"	, ВыборкаДетальныеЗаписи.ДатаРождения);
		Структура.Вставить("ИНН"			, ВыборкаДетальныеЗаписи.ИНН);
		Структура.Вставить("ФИО"			, ВыборкаДетальныеЗаписи.ФИО);
		Структура.Вставить("Источник"		, Источник);
		
		ФизЛицоРС = СоздатьФизЛицоРС(Структура); 
		
		РС_ОбщийМодульСервер.ЗаполнитьКИ(ФизЛицоРС, ВыборкаДетальныеЗаписи.Ссылка);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция СоздатьФизЛицоРС(Структура)
			
	ПоискФЛ = РС_ОбщийМодульСервер.НайтиФизЛицо(Структура);
	
	Если ЗначениеЗаполнено(ПоискФЛ) Тогда 
		НовыйЭлемент = ПоискФЛ.ПолучитьОбъект();
	Иначе
		НовыйЭлемент = Справочники.РС_ФизическиеЛица.СоздатьЭлемент();	
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(НовыйЭлемент, Структура);
	
	Ист = Справочники.Организации.ОрганизацияПоУмолчанию(Неопределено);
	
	НовыйЭлемент.Источник = "" + Ист.ИНН + ", " + Ист.Наименование; 
	
	НовыйЭлемент.Записать();
	
	Возврат НовыйЭлемент.Ссылка;
	
КонецФункции 

&НаКлиенте
Процедура КомандаЗаполнитьСправочник(Команда)
	КомандаЗаполнитьСправочникНаСервере();
КонецПроцедуры

&НаСервере
Процедура Команда1НаСервере()
	
	Выборка = Справочники.РС_ФизическиеЛица.Выбрать();
	Пока Выборка.Следующий() Цикл 
		Если Выборка.КонтактнаяИнформация.Количество() = 0 Тогда 
			СправочникОбъект = Выборка.ПолучитьОбъект();
			СправочникОбъект.НетКИ = Истина;
			СправочникОбъект.Записать();
		КонецЕсли;	
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура Команда1(Команда)
	Команда1НаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьФИОНаСервере()
	
	Выборка = Справочники.РС_ФизическиеЛица.Выбрать();
	Пока Выборка.Следующий() Цикл 
		СправочникОбъект = Выборка.ПолучитьОбъект();
		Если ЗначениеЗаполнено(Выборка.ФИО) Тогда 
			СправочникОбъект.Наименование = СправочникОбъект.ФИО;
		Иначе
			СправочникОбъект.ФИО = СправочникОбъект.Наименование;
		КонецЕсли;
		СправочникОбъект.Записать();
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьФИО(Команда)
	ЗаполнитьФИОНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуНаСервере()
	
	Табл.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РС_ФизическиеЛицаКонтактнаяИнформация.Ссылка КАК Ссылка,
		|	РС_ФизическиеЛицаКонтактнаяИнформация.Ссылка.ФИО КАК ФИО,
		|	РС_ФизическиеЛицаКонтактнаяИнформация.Ссылка.ИНН КАК ИНН,
		|	РС_ФизическиеЛицаКонтактнаяИнформация.Вид КАК ВидКИ,
		|	РС_ФизическиеЛицаКонтактнаяИнформация.Тип КАК ТипКИ,
		|	РС_ФизическиеЛицаКонтактнаяИнформация.Представление КАК ПредставлениеКИ,
		|	РС_ФизическиеЛицаКонтактнаяИнформация.НомерСтроки КАК НомСтр
		|ИЗ
		|	Справочник.РС_ФизическиеЛица.КонтактнаяИнформация КАК РС_ФизическиеЛицаКонтактнаяИнформация
		|ГДЕ
		|	НЕ РС_ФизическиеЛицаКонтактнаяИнформация.Ссылка.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	ФИО,
		|	ИНН,
		|	ПредставлениеКИ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Таб = РезультатЗапроса.Выгрузить();
	Таб.Свернуть("ФИО, ИНН");
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ИНН) Тогда 
			НоваяСтрока =  Табл.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
		КонецЕсли;
	КонецЦикла;
	
    Табл2.Загрузить(Таб); 
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТаблицу(Команда)
	ЗаполнитьТаблицуНаСервере();
КонецПроцедуры

&НаСервере
Процедура УдалитьДублиНаСервере()

	Для Каждого СтрТаб Из Табл2 Цикл 
		
		Структура = Новый Структура;
		Структура.Вставить("ФИО"	, СтрТаб.ФИО);
		Структура.Вставить("ИНН"	, СтрТаб.ИНН); 
		
		МассивСтрок = Табл.НайтиСтроки(Структура);
		
		текОбъект = Неопределено;
		Для Каждого СтрМассива Из МассивСтрок Цикл 
			Если текОбъект = Неопределено Тогда 
				текОбъект = СтрМассива.Ссылка;
				Продолжить;
			КонецЕсли;
			
			Если Не текОбъект = СтрМассива.Ссылка Тогда //Если Элемент массива не совподает 
				
				//Записываем в тек (общий)
				СправочникОбъект = текОбъект.ПолучитьОбъект(); 	
				
				//Найдем строку КИ в др. элементе
				СтрокаКИ 	= СтрМассива.Ссылка.КонтактнаяИнформация.Получить(СтрМассива.НомСтр-1);   
				
				//Тут надо проверить что такая строка есть или нет
				СтруктураКИ = Новый Структура;
				СтруктураКИ.Вставить("Вид"			,СтрМассива.ВидКИ);
				СтруктураКИ.Вставить("Тип"			,СтрМассива.ТипКИ);
				СтруктураКИ.Вставить("Представление",СтрМассива.ПредставлениеКИ);  
				масСтрок =  СправочникОбъект.КонтактнаяИнформация.НайтиСтроки(СтруктураКИ);
				
				Если масСтрок.Количество() = 0 Тогда 
					//Заполним Общ. строку из др. элемента
					НоваяСтрока = СправочникОбъект.КонтактнаяИнформация.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаКИ);              	 
					СправочникОбъект.Записать(); 
					
					//Удалим др. элемент 
					Если СтрМассива.Ссылка.ПометкаУдаления = Ложь Тогда 
						СпрОбъект = СтрМассива.Ссылка.ПолучитьОбъект(); 
						СпрОбъект.ПометкаУдаления = Истина;
						СпрОбъект.Записать(); 
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;	
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьДубли(Команда)
	УдалитьДублиНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбъединитьНаСервере(МассивСтрок) 
	
	текОбъект = Неопределено;
	Для Каждого СтрМассива Из МассивСтрок Цикл 
		Если текОбъект = Неопределено Тогда 
			текОбъект = СтрМассива.Ссылка;
			Продолжить;
		КонецЕсли; 
		
		//Если Элемент массива не совподает
		Если Не текОбъект = СтрМассива.Ссылка Тогда 
			
			//Записываем в тек (общий)
			СправочникОбъект = текОбъект.ПолучитьОбъект();
			
			//Переберем строки КИ в др. элементе
			Для Каждого СтрокаКИ Из СтрМассива.Ссылка.КонтактнаяИнформация Цикл 
				//Тут надо проверить что такая строка есть или нет
				СтруктураКИ = Новый Структура;
				СтруктураКИ.Вставить("Вид"			,СтрокаКИ.Вид);
				СтруктураКИ.Вставить("Тип"			,СтрокаКИ.Тип);
				СтруктураКИ.Вставить("Представление",СокрЛП(СтрокаКИ.Представление));  
				масСтрок =  СправочникОбъект.КонтактнаяИнформация.НайтиСтроки(СтруктураКИ);
			
				Если масСтрок.Количество() = 0 Тогда
					//Заполним Общ. строку из др. элемента
					НоваяСтрока = СправочникОбъект.КонтактнаяИнформация.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаКИ);              	 
					СправочникОбъект.Записать(); 			
				КонецЕсли;
			КонецЦикла; 
			//Удалим др. элемент 
			Если СтрМассива.Ссылка.ПометкаУдаления = Ложь Тогда 
				СпрОбъект = СтрМассива.Ссылка.ПолучитьОбъект(); 
				СпрОбъект.ПометкаУдаления = Истина;
				СпрОбъект.Записать(); 
			КонецЕсли;	
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОбъединить(Команда) 
	МассивСтрок = Элементы.Список.ВыделенныеСтроки;
	ОбъединитьНаСервере(МассивСтрок);
КонецПроцедуры
